# SetValueString Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyManager..::..SetValueString Method
FamilyManager Class See Also
---
Set the string value of a family parameter of the current family type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetValueString(
	FamilyParameter familyParameter,
	string value
)
```

Visual Basic
---
```text
Public Sub SetValueString ( _
	familyParameter As FamilyParameter, _
	value As String _
)
```

Visual C++
---
```text
public:
void SetValueString(
	FamilyParameter^ familyParameter,
	String^ value
)
```

# ### Parameters
familyParameter
    Type: Autodesk.Revit.DB..::..FamilyParameterThe family parameter of current type.
value
    Type: System..::..StringThe new value string for family parameter.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the input argument-"familyParameter" or "value"-is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the input argument-"familyParameter"-is an invalid family parameter. or the input argument-"value"-is an illegal string. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when the input argument-"familyParameter"-is out of range. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the family parameter is determined by formula, or it is not a value type, or the current family type is invalid. |

# See Also
FamilyManager Class
Autodesk.Revit.DB Namespace